src/Documents/Scan_УстановкаПлановыхЦенПродукта/Scan_УстановкаПлановыхЦенПродукта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_УстановкаПлановыхЦенПродукта</name>
  <basedOn>Document.Scan_УстановкаПлановыхЦенПродукта</basedOn>
  <registerRecords>InformationRegister.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта</registerRecords>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаDealerNetСоСкидкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаRetailPriceСоСкидкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_УстановкаПлановыхЦенПродукта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <attributes>
      <name>СоставляющаяЦены</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.Scan_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
        <types>CatalogRef.Scan_СоглашенияОПоставке</types>
        <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрайсЛист</name>
    <attributes>
      <name>СоставляющаяЦены</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ПлановыеЗначенияСоставляющихЦеныПродукта/Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПлановыеЗначенияСоставляющихЦеныПродукта</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставляющаяЦены</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Scan_УстановкаПлановыхЦенПродукта/ObjectModule.bsl
// rarus tenkam 06.08.2020 mantis 16181 +++
Процедура ОбработкаПроведения(Отказ, Режим) 	
		
	// регистр Scan_ПлановыеЗначенияСоставляющихЦеныПродукта
	Движения.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.Записывать = Истина;
	
	Если НЕ ДокументОтменен Тогда
		Для Каждого ТекСтрокаСкидкиНаценки Из СкидкиНаценки Цикл
			Движение = Движения.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.Добавить();
			Движение.Период = Дата;
			Движение.Продукт = Продукт;
			Движение.СоставляющаяЦены = ТекСтрокаСкидкиНаценки.СоставляющаяЦены;
			Движение.ЦенаСНДС = ТекСтрокаСкидкиНаценки.ЦенаСНДС;
			Движение.ЦенаБезНДС = ТекСтрокаСкидкиНаценки.ЦенаБезНДС;
			Движение.СоглашениеОПоставке = СоглашениеОПоставке;
			Движение.СтавкаНДС = ТекСтрокаСкидкиНаценки.СтавкаНДС;
			Движение.ХозОперация = ХозОперация;
			Движение.Пользователь = ТекСтрокаСкидкиНаценки.Пользователь;
			Движение.Комментарий = ТекСтрокаСкидкиНаценки.Комментарий;	// rarus tenkam 16.04.2021 mantis 17648 +
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_УстановкаПлановыхЦенПродукта") Тогда
		Автор = ПользователиКлиентСервер.АвторизованныйПользователь();
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//ДатаПроведения = ДанныеЗаполнения.ДатаПроведения;
		ДатаСоздания = ТекущаяДата();
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ДокументОтменен = Ложь;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Компания = ДанныеЗаполнения.Компания;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Менеджер = ДанныеЗаполнения.Менеджер;
		Организация = ДанныеЗаполнения.Организация;
		ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
		Продукт = ДанныеЗаполнения.Продукт;
		СоглашениеОПоставке = ДанныеЗаполнения.СоглашениеОПоставке;
		СпециальныеУсловия = ДанныеЗаполнения.СпециальныеУсловия;
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.КорректировкаПлановыхЦенПродуктов;
		ЦенаDealerNetСоСкидкой = ДанныеЗаполнения.ЦенаDealerNetСоСкидкой;
		ЦенаRetailPriceСоСкидкой = ДанныеЗаполнения.ЦенаRetailPriceСоСкидкой;
		ШтрихКод = ДанныеЗаполнения.ШтрихКод;
		Для Каждого ТекСтрокаПрайсЛист Из ДанныеЗаполнения.ПрайсЛист Цикл
			НоваяСтрока = ПрайсЛист.Добавить();
			НоваяСтрока.СоставляющаяЦены = ТекСтрокаПрайсЛист.СоставляющаяЦены;
			НоваяСтрока.Цена = ТекСтрокаПрайсЛист.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаСкидкиНаценки Из ДанныеЗаполнения.СкидкиНаценки Цикл
			НоваяСтрока = СкидкиНаценки.Добавить();
			НоваяСтрока.Источник = ТекСтрокаСкидкиНаценки.Источник;
			НоваяСтрока.Пользователь = ТекСтрокаСкидкиНаценки.Пользователь;
			НоваяСтрока.СоставляющаяЦены = ТекСтрокаСкидкиНаценки.СоставляющаяЦены;
			НоваяСтрока.СтавкаНДС = ТекСтрокаСкидкиНаценки.СтавкаНДС;
			НоваяСтрока.ЦенаБезНДС = ТекСтрокаСкидкиНаценки.ЦенаБезНДС;
			НоваяСтрока.ЦенаСНДС = ТекСтрокаСкидкиНаценки.ЦенаСНДС;
			НоваяСтрока.Комментарий = ТекСтрокаСкидкиНаценки.Комментарий;	// rarus tenkam 16.04.2021 mantis 17648 +
		КонецЦикла;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ДокументОтменен Тогда
		Документы.Scan_УстановкаПлановыхЦенПродукта.ОткрепитьДокументОтПродукта(Ссылка);
	Иначе
		Документы.Scan_УстановкаПлановыхЦенПродукта.ЗакрепитьДокументУстановкиЦенПродукта(Ссылка);
	КонецЕсли;
КонецПроцедуры
// rarus tenkam 06.08.2020 mantis 16181 ---
